OpenFOAM-10/test/multiphase/multiphaseEulerFoam/populationBalance/drift/constant/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

waterSink
{
    type            massSource;

    selectionMode   all;

    massFlowRate    -21.86682;

    phase           water;
    rho             thermo:rho.water;

    fieldValues
    {
        U.water     (0 0 0);
    }
}

// ************************************************************************* //
